## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/0344e908-d36f-48f0-93d9-acd6e7d1879a/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/dev-velidaaks"
        name                                = "dev-velidaaks"
        tags                                = {
            "environment" = "dev"
            "owner"       = "willvelida"
        }
        # (36 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {}
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.managed-grafana.azurerm_dashboard_grafana.grafana must be replaced
-/+ resource "azurerm_dashboard_grafana" "grafana" {
      ~ endpoint                               = "https://dev-grafana-velidaaks-afgme2gaa5gndwbc.eau.grafana.azure.com" -> (known after apply)
      ~ grafana_version                        = "10.4.7" -> (known after apply)
      ~ id                                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/dev-grafana-velidaaks" -> (known after apply)
        name                                   = "dev-grafana-velidaaks"
      ~ outbound_ip                            = [] -> (known after apply)
        tags                                   = {
            "environment" = "dev"
            "owner"       = "willvelida"
        }
        # (9 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [ # forces replacement
              - "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dev-uai-velidaaks",
            ] -> null
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          ~ type         = "UserAssigned" -> "SystemAssigned" # forces replacement
        }

        # (1 unchanged block hidden)
    }

  # module.monitoring_data_reader_role.azurerm_role_assignment.role must be replaced
-/+ resource "azurerm_role_assignment" "role" {
      ~ id                                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/dev-amw-velidaaks/providers/Microsoft.Authorization/roleAssignments/773f63e0-182b-fb18-4b83-0cd555a37ad4" -> (known after apply)
      ~ name                                   = "773f63e0-182b-fb18-4b83-0cd555a37ad4" -> (known after apply)
      ~ principal_id                           = "92f582f4-918d-4a4b-805b-636d6f83b572" # forces replacement -> (known after apply) # forces replacement
      ~ role_definition_id                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/providers/Microsoft.Authorization/roleDefinitions/b0d8363b-8ddd-447d-831f-62ca05bff136" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.aks.azurerm_kubernetes_cluster.aks will be updated in-place%0A  ~ resource "azurerm_kubernetes_cluster" "aks" {%0A        id                                  = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/dev-velidaaks"%0A        name                                = "dev-velidaaks"%0A        tags                                = {%0A            "environment" = "dev"%0A            "owner"       = "willvelida"%0A        }%0A        # (36 unchanged attributes hidden)%0A%0A      ~ default_node_pool {%0A            name                          = "default"%0A            tags                          = {}%0A            # (33 unchanged attributes hidden)%0A%0A          - upgrade_settings {%0A              - drain_timeout_in_minutes      = 0 -> null%0A              - max_surge                     = "10%25" -> null%0A              - node_soak_duration_in_minutes = 0 -> null%0A            }%0A        }%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # module.managed-grafana.azurerm_dashboard_grafana.grafana must be replaced%0A-/+ resource "azurerm_dashboard_grafana" "grafana" {%0A      ~ endpoint                               = "https://dev-grafana-velidaaks-afgme2gaa5gndwbc.eau.grafana.azure.com" -> (known after apply)%0A      ~ grafana_version                        = "10.4.7" -> (known after apply)%0A      ~ id                                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/dev-grafana-velidaaks" -> (known after apply)%0A        name                                   = "dev-grafana-velidaaks"%0A      ~ outbound_ip                            = [] -> (known after apply)%0A        tags                                   = {%0A            "environment" = "dev"%0A            "owner"       = "willvelida"%0A        }%0A        # (9 unchanged attributes hidden)%0A%0A      ~ identity {%0A          - identity_ids = [ # forces replacement%0A              - "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dev-uai-velidaaks",%0A            ] -> null%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          ~ type         = "UserAssigned" -> "SystemAssigned" # forces replacement%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.monitoring_data_reader_role.azurerm_role_assignment.role must be replaced%0A-/+ resource "azurerm_role_assignment" "role" {%0A      ~ id                                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/dev-amw-velidaaks/providers/Microsoft.Authorization/roleAssignments/773f63e0-182b-fb18-4b83-0cd555a37ad4" -> (known after apply)%0A      ~ name                                   = "773f63e0-182b-fb18-4b83-0cd555a37ad4" -> (known after apply)%0A      ~ principal_id                           = "92f582f4-918d-4a4b-805b-636d6f83b572" # forces replacement -> (known after apply) # forces replacement%0A      ~ role_definition_id                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/providers/Microsoft.Authorization/roleDefinitions/b0d8363b-8ddd-447d-831f-62ca05bff136" -> (known after apply)%0A      + skip_service_principal_aad_check       = (known after apply)%0A        # (7 unchanged attributes hidden)%0A    }%0A%0APlan: 2 to add, 1 to change, 2 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>